TexasInstruments/ble_examples/examples/rtos/LP_EM_CC1354P10_1/ble5stack/ble32_connection_central/simple_central.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/ti/boards/LP_EM_CC1354P10_1" --rtos "tirtos7" --product "simplelink_cc13xx_cc26xx_sdk@7.10.01.24"
 * @versions {"tool":"1.16.2+3028"}
 */

/**
 * Import the modules used in this configuration.
 */
const ble          = scripting.addModule("/ti/ble5stack/ble");
const CCFG         = scripting.addModule("/ti/devices/CCFG");
const rfdesign     = scripting.addModule("/ti/devices/radioconfig/rfdesign");
const Display      = scripting.addModule("/ti/display/Display");
const Display1     = Display.addInstance();
const AESCCM       = scripting.addModule("/ti/drivers/AESCCM");
const AESCCM1      = AESCCM.addInstance();
const AESCTRDRBG   = scripting.addModule("/ti/drivers/AESCTRDRBG");
const AESCTRDRBG1  = AESCTRDRBG.addInstance();
const AESECB       = scripting.addModule("/ti/drivers/AESECB");
const AESECB1      = AESECB.addInstance();
const ECDH         = scripting.addModule("/ti/drivers/ECDH");
const ECDH1        = ECDH.addInstance();
const GPIO         = scripting.addModule("/ti/drivers/GPIO");
const GPIO1        = GPIO.addInstance();
const GPIO2        = GPIO.addInstance();
const GPIO3        = GPIO.addInstance();
const GPIO4        = GPIO.addInstance();
const GPIO5        = GPIO.addInstance();
const GPIO6        = GPIO.addInstance();
const GPIO7        = GPIO.addInstance();
const GPIO8        = GPIO.addInstance();
const NVS          = scripting.addModule("/ti/drivers/NVS");
const NVS1         = NVS.addInstance();
const Power        = scripting.addModule("/ti/drivers/Power");
const RF           = scripting.addModule("/ti/drivers/RF");
const SPI          = scripting.addModule("/ti/drivers/SPI", {}, false);
const SPI1         = SPI.addInstance();
const TRNG         = scripting.addModule("/ti/drivers/TRNG");
const TRNG1        = TRNG.addInstance();
const LED          = scripting.addModule("/ti/drivers/apps/LED", {}, false);
const LED1         = LED.addInstance();
const LED2         = LED.addInstance();
const Settings     = scripting.addModule("/ti/posix/tirtos/Settings");
const BIOS         = scripting.addModule("/ti/sysbios/BIOS");
const GateMutexPri = scripting.addModule("/ti/sysbios/gates/GateMutexPri");
const HeapCallback = scripting.addModule("/ti/sysbios/heaps/HeapCallback");
const Event        = scripting.addModule("/ti/sysbios/knl/Event");
const Idle         = scripting.addModule("/ti/sysbios/knl/Idle", {}, false);
const Idle2        = Idle.addInstance();
const Mailbox      = scripting.addModule("/ti/sysbios/knl/Mailbox");
const Error        = scripting.addModule("/ti/sysbios/runtime/Error");
const SysCallback  = scripting.addModule("/ti/sysbios/runtime/SysCallback");
const Timestamp    = scripting.addModule("/ti/sysbios/runtime/Timestamp");

/**
 * Write custom configuration values to the imported modules.
 */
ble.deviceRole                            = "CENTRAL_CFG";
ble.lockProject                           = true;
ble.deviceName                            = "Simple Central";
ble.maxPDUNum                             = 255;
ble.maxPDUSize                            = 255;
ble.bondPairing                           = "GAPBOND_PAIRING_MODE_NO_PAIRING";
ble.bondMITMProtection                    = false;
ble.bonding                               = false;
ble.extendedStackSettings                 = "MASTER_GUARD_TIME_ENABLE";
ble.advRptFields                          = ["SCAN_ADVRPT_FLD_ADDRESS"];
ble.disDevBySerUuid                       = true;
ble.maxConnNum                            = 32;
ble.scanInt                               = 1000;
ble.scanWin                               = 1000;
ble.scanDuration                          = 2000;
ble.connIntMin                            = 200;
ble.connIntMax                            = 200;
ble.defaultTxPower                        = "HCI_EXT_TX_POWER_5_DBM";
ble.radioConfig.codeExportConfig.$name    = "ti_devices_radioconfig_code_export_param0";
ble.connUpdateParamsCentral.$name         = "ti_ble5stack_general_ble_conn_update_params0";
ble.connUpdateParamsCentral.reqMinConnInt = 200;
ble.connUpdateParamsCentral.reqMaxConnInt = 200;

CCFG.xoscCapArray             = true;
CCFG.xoscCapArrayDelta        = 0xD5;
CCFG.enableBootloader         = true;
CCFG.enableBootloaderBackdoor = true;
CCFG.dioBootloaderBackdoor    = 15;
CCFG.levelBootloaderBackdoor  = "Active low";
CCFG.ccfgTemplate.$name       = "ti_devices_CCFG_CCFGCC26XXTemplate0";

rfdesign.rfDesign = "LP_EM_CC1354P10_1";

Display1.$name                    = "CONFIG_Display_0";
Display1.$hardware                = system.deviceData.board.components.XDS110UART;
Display1.enableANSI               = true;
Display1.uartBufferSize           = 128;
Display1.uart.$name               = "CONFIG_DISPLAY_UART";
Display1.uart.txPinInstance.$name = "CONFIG_GPIO_UART_TX";
Display1.uart.rxPinInstance.$name = "CONFIG_GPIO_UART_RX";

AESCCM1.$name = "Board_AESCCM0";

AESCTRDRBG1.$name = "CONFIG_AESCTRDRBG_0";

AESECB1.$name = "CONFIG_AESECB0";

ECDH1.$name = "CONFIG_ECDH0";

GPIO1.$hardware = system.deviceData.board.components["BTN-1"];
GPIO1.$name     = "CONFIG_GPIO_BTN1";

GPIO2.$hardware = system.deviceData.board.components["BTN-2"];
GPIO2.$name     = "CONFIG_GPIO_BTN2";

GPIO3.$name           = "CONFIG_GPIO_STROBE1";
GPIO3.mode            = "Output";
GPIO3.gpioPin.$assign = "boosterpack.23";

GPIO4.$name           = "CONFIG_GPIO_STROBE2";
GPIO4.mode            = "Output";
GPIO4.gpioPin.$assign = "boosterpack.24";

GPIO5.$name           = "CONFIG_GPIO_STROBE3";
GPIO5.mode            = "Output";
GPIO5.gpioPin.$assign = "boosterpack.25";

GPIO6.$name           = "CONFIG_GPIO_BLE_MREQ";
GPIO6.gpioPin.$assign = "boosterpack.37";

GPIO7.$name           = "CONFIG_GPIO_BLE_IRQ";
GPIO7.mode            = "Output";
GPIO7.gpioPin.$assign = "boosterpack.29";

GPIO8.$name           = "CONFIG_GPIO_BLE_SACK";
GPIO8.mode            = "Output";
GPIO8.gpioPin.$assign = "boosterpack.30";

NVS1.$name                    = "CONFIG_NVSINTERNAL";
NVS1.internalFlash.$name      = "ti_drivers_nvs_NVSCC26XX0";
NVS1.internalFlash.regionBase = 0x48000;
NVS1.internalFlash.regionSize = 0x4000;

RF.$hardware = system.deviceData.board.components["SKY13317-373LF"];

SPI1.$name               = "CONFIG_SPI_0";
SPI1.mode                = "Four Pin CS Active Low";
SPI1.spi.sclkPin.$assign = "boosterpack.13";
SPI1.spi.pociPin.$assign = "boosterpack.39";
SPI1.spi.picoPin.$assign = "boosterpack.40";
SPI1.spi.csnPin.$assign  = "boosterpack.12";

TRNG1.$name = "CONFIG_TRNG_0";

LED1.$name         = "CONFIG_LED_0";
LED1.$hardware     = system.deviceData.board.components.LED_RED;
LED1.gpioPin.$name = "CONFIG_GPIO_LED_RED";

LED2.$name         = "CONFIG_LED_1";
LED2.$hardware     = system.deviceData.board.components.LED_GREEN;
LED2.gpioPin.$name = "CONFIG_GPIO_LED_GREEN";

BIOS.assertsEnabled = false;
BIOS.rtsGateType    = "BIOS_GateMutexPri";
BIOS.heapSize       = 0x00000000;
BIOS.heapType       = "HeapCallback";

const Hwi           = scripting.addModule("/ti/sysbios/family/arm/v8m/Hwi", {}, false);
Hwi.enableException = false;

HeapCallback.initFxn           = "osalHeapInitFxn";
HeapCallback.allocInstFxn      = "osalHeapAllocFxn";
HeapCallback.freeInstFxn       = "osalHeapFreeFxn";
HeapCallback.getStatsInstFxn   = "osalHeapGetStatsFxn";
HeapCallback.isBlockingInstFxn = "osalHeapIsBlockingFxn";

const Clock       = scripting.addModule("/ti/sysbios/knl/Clock", {}, false);
Clock.tickPeriod  = 10;
Clock.swiPriority = 5;

const Timer = scripting.addModule("/ti/sysbios/family/arm/v8m/cc26x4/Timer", {}, false);

Idle2.$name   = "powerIdle";
Idle2.idleFxn = "Power_idleFunc";

const Semaphore            = scripting.addModule("/ti/sysbios/knl/Semaphore", {}, false);
Semaphore.supportsPriority = false;

const Swi         = scripting.addModule("/ti/sysbios/knl/Swi", {}, false);
Swi.numPriorities = 6;

const Task             = scripting.addModule("/ti/sysbios/knl/Task", {}, false);
Task.defaultStackSize  = 512;
Task.idleTaskStackSize = 768;
Task.numPriorities     = 6;

Error.policy       = "Error_SPIN";
Error.printDetails = false;

const System           = scripting.addModule("/ti/sysbios/runtime/System", {}, false);
System.abortFxn        = "System_abortSpin";
System.exitFxn         = "System_exitSpin";
System.extendedFormats = "%f";
System.supportModule   = "SysCallback";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Display1.uart.uart.$suggestSolution       = "UART0";
Display1.uart.uart.txPin.$suggestSolution = "boosterpack.4";
Display1.uart.uart.rxPin.$suggestSolution = "boosterpack.3";
GPIO1.gpioPin.$suggestSolution            = "boosterpack.11";
GPIO2.gpioPin.$suggestSolution            = "boosterpack.17";
RF.rfAntennaPin0.$suggestSolution         = "DIO_34";
RF.rfAntennaPin1.$suggestSolution         = "DIO_3";
RF.rfAntennaPin2.$suggestSolution         = "DIO_35";
SPI1.spi.$suggestSolution                 = "SPI0";
SPI1.spi.dmaRxChannel.$suggestSolution    = "DMA_CH3";
SPI1.spi.dmaTxChannel.$suggestSolution    = "DMA_CH4";
LED1.ledPin.$suggestSolution              = "DIO_6";
LED2.ledPin.$suggestSolution              = "DIO_7";
Timer.rtc.$suggestSolution                = "RTC0";
